In [5]:
%load_ext sql

In [7]:
%reload_ext sql

In [9]:
%sql sqlite://

#### Q-1. Write an SQL query to print the first three characters of  FIRST_NAME from Worker table.

In [10]:
%%sql
CREATE TABLE WORKER(FIRST_NAME VARCHAR(50), LAST_NAME VARCHAR(50), DEPARTMENT VARCHAR(50), SALARY INT(10))

 * sqlite://
Done.

[]

In [11]:
%%sql
Insert into worker values("Amitabh",'sam','Finance',145000);
Insert into worker values("venky",'suri','HR',65000);
Insert into worker values("prasad",'reddy','Telecom',55000);                                                                       
Insert into worker values("babu",'mohan','Markt',35000);                                                                       
Insert into worker values("kalyan",'ram','General',45000);                                                                       
Insert into worker values("venkata",'ram','HR',65000);                                                                       
Insert into worker values("ram",'sam','Techincal',36000);                                                                       
Insert into worker values("Anji",'Reddy','HOD',200000);                                                                       
Insert into worker values("Nag",'sam','Banking',125000);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [13]:
%%sql
select * from worker

 * sqlite://
Done.

[('Amitabh', 'sam', 'Finance', 145000),
 ('venky', 'suri', 'HR', 65000),
 ('prasad', 'reddy', 'Telecom', 55000),
 ('babu', 'mohan', 'Markt', 35000),
 ('kalyan', 'ram', 'General', 45000),
 ('venkata', 'ram', 'HR', 65000),
 ('ram', 'sam', 'Techincal', 36000),
 ('Anji', 'Reddy', 'HOD', 200000),
 ('Nag', 'sam', 'Banking', 125000)]

In [15]:
%%sql
select substring(FIRST_NAME,1,3)FROM worker

 * sqlite://
Done.

[('Ami',),
 ('ven',),
 ('pra',),
 ('bab',),
 ('kal',),
 ('ven',),
 ('ram',),
 ('Anj',),
 ('Nag',)]

#### Q-2. Write an SQL query to find the position of the alphabet (‘a’) in the first name column ‘Amitabh’ from Worker table.

In [22]:
%%sql
select instr(FIRST_NAME,"a") from WORKER WHERE FIRST_NAME='Amitabh';

 * sqlite://
Done.

[(5,)]

#### Q-3. Write an SQL query to print the name of employees having the highest salary in each department.

In [29]:
%%sql
SELECT * FROM Worker w WHERE salary = (select Max(salary) from Worker where department = w.department)

 * sqlite://
Done.

[('Amitabh', 'sam', 'Finance', 145000),
 ('venky', 'suri', 'HR', 65000),
 ('prasad', 'reddy', 'Telecom', 55000),
 ('babu', 'mohan', 'Markt', 35000),
 ('kalyan', 'ram', 'General', 45000),
 ('venkata', 'ram', 'HR', 65000),
 ('ram', 'sam', 'Techincal', 36000),
 ('Anji', 'Reddy', 'HOD', 200000),
 ('Nag', 'sam', 'Banking', 125000)]